# Pandas для анализа данных

In [1]:
import pandas as pd

## Чтение данных и чистка

In [15]:
test1 = pd.read_csv("test.csv")

In [16]:
test1

                           ;;;;
0  ;Name;Family Name;Age;Height
1        ;Anton;Egorov;35;178.3
2        ;Igor;Krasnyi;23;192.2
3   ;Vladimir;Sikorski;76;184.7
4      ;Sergei;Efremov;32;179.4

In [17]:
test1 = pd.read_csv("test.csv",sep=";")

In [18]:
test1

   Unnamed: 0 Unnamed: 1   Unnamed: 2 Unnamed: 3 Unnamed: 4
0         NaN       Name  Family Name        Age     Height
1         NaN      Anton       Egorov         35      178.3
2         NaN       Igor      Krasnyi         23      192.2
3         NaN   Vladimir     Sikorski         76      184.7
4         NaN     Sergei      Efremov         32      179.4

In [25]:
test1 = pd.read_csv("test.csv",sep=";",header=1)

In [26]:
test1

   Unnamed: 0      Name Family Name  Age  Height
0         NaN     Anton      Egorov   35   178.3
1         NaN      Igor     Krasnyi   23   192.2
2         NaN  Vladimir    Sikorski   76   184.7
3         NaN    Sergei     Efremov   32   179.4

In [28]:
test1.drop('Unnamed: 0',inplace=True)

KeyError: "['Unnamed: 0'] not found in axis"

In [31]:
test1.columns

Index(['Unnamed: 0', 'Name', 'Family Name', 'Age', 'Height'], dtype='object')

In [34]:
test1.drop(test1.columns[0],inplace=True,axis=1)

In [35]:
test1

       Name Family Name  Age  Height
0     Anton      Egorov   35   178.3
1      Igor     Krasnyi   23   192.2
2  Vladimir    Sikorski   76   184.7
3    Sergei     Efremov   32   179.4

In [41]:
test1.loc[0]

Name            Anton
Family Name    Egorov
Age                35
Height          178.3
Name: 0, dtype: object

In [42]:
test1['Name']

0       Anton
1        Igor
2    Vladimir
3      Sergei
Name: Name, dtype: object

In [43]:
test2 = pd.read_excel("test.xlsx")

In [44]:
test2

,Tabelle 1,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,Name,Family Name,Age,Height,NaN,NaN
2,NaN,Anton,Egorov,35,178.3,NaN,NaN
3,NaN,Igor,Krasnyi,23,192.2,NaN,NaN
4,NaN,Vladimir,Sikorski,76,184.7,NaN,NaN
5,NaN,Sergei,Efremov,32,179.4,NaN,NaN

In [52]:
test2 = pd.read_excel("test.xlsx",header=2)

In [53]:
test2

   Unnamed: 0      Name Family Name  Age  Height  Unnamed: 5  Unnamed: 6
0         NaN     Anton      Egorov   35   178.3         NaN         NaN
1         NaN      Igor     Krasnyi   23   192.2         NaN         NaN
2         NaN  Vladimir    Sikorski   76   184.7         NaN         NaN
3         NaN    Sergei     Efremov   32   179.4         NaN         NaN

In [55]:
test2.drop(columns=['Unnamed: 0','Unnamed: 5','Unnamed: 6'],inplace=True)

In [56]:
test2

       Name Family Name  Age  Height
0     Anton      Egorov   35   178.3
1      Igor     Krasnyi   23   192.2
2  Vladimir    Sikorski   76   184.7
3    Sergei     Efremov   32   179.4

## Выбор и создание новых свойств

In [57]:
test1['Name']

0       Anton
1        Igor
2    Vladimir
3      Sergei
Name: Name, dtype: object

In [58]:
test1[['Name','Family Name']]

       Name Family Name
0     Anton      Egorov
1      Igor     Krasnyi
2  Vladimir    Sikorski
3    Sergei     Efremov

In [63]:
test1['Name,Family Name'] = test1['Name'] + ", " + test1['Family Name']

In [64]:
test1

       Name Family Name  Age  Height    Name,Family Name
0     Anton      Egorov   35   178.3       Anton, Egorov
1      Igor     Krasnyi   23   192.2       Igor, Krasnyi
2  Vladimir    Sikorski   76   184.7  Vladimir, Sikorski
3    Sergei     Efremov   32   179.4     Sergei, Efremov

In [67]:
test1.set_index(['Family Name'],inplace=True)

In [68]:
test1

                 Name  Age  Height    Name,Family Name
Family Name
Egorov          Anton   35   178.3       Anton, Egorov
Krasnyi          Igor   23   192.2       Igor, Krasnyi
Sikorski     Vladimir   76   184.7  Vladimir, Sikorski
Efremov        Sergei   32   179.4     Sergei, Efremov

In [110]:
test1.head(2)

              Name  Age  Height Name,Family Name
Family Name
Egorov       Anton   35   178.3    Anton, Egorov
Krasnyi       Igor   23   192.2    Igor, Krasnyi

In [69]:
test1.loc['Egorov']

Name                        Anton
Age                            35
Height                      178.3
Name,Family Name    Anton, Egorov
Name: Egorov, dtype: object

In [70]:
test1.iloc[2]

Name                          Vladimir
Age                                 76
Height                           184.7
Name,Family Name    Vladimir, Sikorski
Name: Sikorski, dtype: object

In [71]:
test1.loc['Egorov','Height']

178.3

In [72]:
test1[test1['Height']>180.0]

                 Name  Age  Height    Name,Family Name
Family Name
Krasnyi          Igor   23   192.2       Igor, Krasnyi
Sikorski     Vladimir   76   184.7  Vladimir, Sikorski

In [73]:
test1[test1['Age']>65]

                 Name  Age  Height    Name,Family Name
Family Name
Sikorski     Vladimir   76   184.7  Vladimir, Sikorski

In [76]:
test1[(test1['Age']<32) & (test1['Height']>180)]

             Name  Age  Height Name,Family Name
Family Name
Krasnyi      Igor   23   192.2    Igor, Krasnyi

## Соединения

In [79]:
new_test = pd.DataFrame.from_dict({'Family Name':['Smith','Yankee'],'Name':['John','William'],'Age':[37,45],'Height':[179.3,184.7]})

In [80]:
new_test

  Family Name     Name  Age  Height
0       Smith     John   37   179.3
1      Yankee  William   45   184.7

In [83]:
new_test['Name,Family Name'] = new_test['Name'] + ", " + new_test['Family Name']

In [87]:
new_test.set_index('Family Name',inplace=True)

In [88]:
total = pd.concat([test1,new_test])

In [89]:
total

                 Name  Age  Height    Name,Family Name
Family Name
Egorov          Anton   35   178.3       Anton, Egorov
Krasnyi          Igor   23   192.2       Igor, Krasnyi
Sikorski     Vladimir   76   184.7  Vladimir, Sikorski
Efremov        Sergei   32   179.4     Sergei, Efremov
Smith            John   37   179.3         John, Smith
Yankee        William   45   184.7     William, Yankee

In [90]:
total_2 = pd.concat([test1,new_test],axis=1)

In [91]:
total_2

,Name,Age,Height,"Name,Family Name",Name,Age,Height,"Name,Family Name"
Egorov,Anton,35.0,178.3,"Anton, Egorov",NaN,NaN,NaN,NaN
Krasnyi,Igor,23.0,192.2,"Igor, Krasnyi",NaN,NaN,NaN,NaN
Sikorski,Vladimir,76.0,184.7,"Vladimir, Sikorski",NaN,NaN,NaN,NaN
Efremov,Sergei,32.0,179.4,"Sergei, Efremov",NaN,NaN,NaN,NaN
Smith,NaN,NaN,NaN,NaN,John,37.0,179.3,"John, Smith"
Yankee,NaN,NaN,NaN,NaN,William,45.0,184.7,"William, Yankee"

In [92]:
new_properties = pd.DataFrame.from_dict({'Family Name':['Smith','Yankee'],'Name':['John','William'],'Salary':[35000,27000],'Department':['A','B']})

In [93]:
new_properties

  Family Name     Name  Salary Department
0       Smith     John   35000          A
1      Yankee  William   27000          B

In [95]:
pd.merge(new_test, new_properties,on=['Family Name','Name'])

  Family Name     Name  Age  Height Name,Family Name  Salary Department
0       Smith     John   37   179.3      John, Smith   35000          A
1      Yankee  William   45   184.7  William, Yankee   27000          B

### Далнейшая информация 
https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html

## Операции

In [97]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [106]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [107]:
df.sort_values(by='col2',ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

### Уникалные элементы

In [99]:
df['col2'].unique()

array([444, 555, 666])

In [100]:
df['col2'].nunique()

3

In [101]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Функции

In [102]:
def times2(x):
    return x*2

In [103]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [104]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [105]:
df['col1'].sum()

10

In [111]:
df['col2'].max()

666

In [112]:
df['col1'].min()

1

In [113]:
df['col2'].mean()

527.25